УТ_для_edt/src/Documents/смартУправлениеАкциями/смартУправлениеАкциями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУправлениеАкциями</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <registerRecords>AccumulationRegister.смартОстаткиАкционныхТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныРозница</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартСтатусыАкций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАкции</name>
    <type>
      <types>EnumRef.смартВидыАкций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаРозница</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаАкция</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОборудованиеДемозала</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТоваров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бонус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусСумма</name>
      <comment>//++ #Б-7562 смарт: Фролов 29.07.2026 //Управление акциями. Добавить колонку Бонусы в руб. в документ Управление акциями</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/демоСтатусГотовностиОборудования/демоСтатусГотовностиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>демоСтатусГотовностиОборудования</name>
  <enumValues>
    <name>Готов</name>
  </enumValues>
  <enumValues>
    <name>НеГотов</name>
  </enumValues>
  <enumValues>
    <name>Частично</name>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартУправлениеАкциями/Forms/ФормаПодбораДИЦ/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Готовность = Перечисления.демоСтатусГотовностиОборудования.Готов;
	
	Параметры.Свойство("ВидЦены", ВидЦены);
	
	Если Параметры.Свойство("ОборудованиеВДокументе") Тогда
		ОборудованиеВДокументе.ЗагрузитьЗначения(Параметры.ОборудованиеВДокументе);
	КонецЕсли;
	
	УстановитьПараметрыОтборов();
	
	//++ #Б-7542 смарт: Фролов 23.07.2026 //Управление акциями. Ошибка отображения акции Распродажа демозала
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Количество");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементУсловия.ПравоеЗначение = 0;
	ЭлементУсловия.Использование = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250, 128, 114));
	//-- #Б-7542 смарт: Фролов 23.07.2026
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавитьОборудованиеДляПереносаВДокумент(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(ПоместитьДанныеДляПереносаВоВременноеХранилище());
	
КонецПроцедуры

&НаКлиенте
Процедура ГотовностьПриИзменении(Элемент)
	
	УстановитьПараметрыОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтрокиДляПереноса(Команда)
	
	Для каждого ВыбраннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ДобавитьОборудованиеДляПереносаВДокумент(ВыбраннаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроки(Команда)
	
	МассивСтрок = Новый Массив;
	
	Для каждого ВыбраннаяСтрока Из Элементы.Корзина.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(Корзина.НайтиПоИдентификатору(ВыбраннаяСтрока));
	КонецЦикла;
	
	Для каждого стр Из МассивСтрок Цикл
		Корзина.Удалить(стр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаПриИзменении(Элемент)
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Функция ПоместитьДанныеДляПереносаВоВременноеХранилище()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Серия");
	ТЗ.Колонки.Добавить("Склад");
	ТЗ.Колонки.Добавить("ОборудованиеДемозала");
	
	Для каждого стрКорзина Из Корзина Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Номенклатура = стрКорзина.Оборудование.Номенклатура;
		НоваяСтрока.Серия = стрКорзина.Оборудование.Серия;
		НоваяСтрока.Склад = стрКорзина.Оборудование.ДемоЗал;
		НоваяСтрока.ОборудованиеДемозала = стрКорзина.Оборудование;
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТЗ);
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыОтборов()
	
	Параметр = Список.Параметры.Элементы.Найти("ТекДата");
	Параметр.Значение = ТекущаяДата();
	Параметр.Использование = Истина;
	
	Параметр = Список.Параметры.Элементы.Найти("Готовность");
	Параметр.Использование = Истина;
	Параметр.Значение = Готовность;
	
	Параметр = Список.Параметры.Элементы.Найти("ВыбранноеОборудование");
	Параметр.Использование = Истина;
	Параметр.Значение = ОборудованиеВДокументе.ВыгрузитьЗначения();
	
	Параметр = Список.Параметры.Элементы.Найти("ВидЦены");
	Параметр.Использование = Истина;
	Параметр.Значение = ВидЦены;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОборудованиеДляПереносаВДокумент(Оборудование)
	
	Если НЕ ЗначениеЗаполнено(Оборудование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Оборудование) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Оборудование) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	Если Корзина.НайтиСтроки(Новый Структура("Оборудование", Оборудование)).Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОборудованиеВДокументе.НайтиПоЗначению(Оборудование) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Корзина.Добавить();
	НоваяСтрока.Оборудование = Оборудование;
	
КонецПроцедуры

#КонецОбласти
